app/controllers/classificacaos_controller.rb

SELECT `classificacaos`.* FROM `classificacaos`
---
  def index
    @classificacaos = Classificacao.all

SELECT `classificacaos`.* FROM `classificacaos` WHERE `classificacaos`.`id` = 1 LIMIT 1
---
  def show
    @classificacao = Classificacao.find(params[:id])

INSERT INTO `classificacaos` (`created_at`, `derrotas`, `empates`, `gols`, `golscontra`, `id_time`, `jogos`, `pontos`, `saldogols`, `updated_at`, `vitorias`) VALUES ('2012-12-12 22:58:28', 0, 1, 3, 2, NULL, 2, 4, 1, '2012-12-12 22:58:28', 1)
---
  def create
    @classificacao = Classificacao.new(params[:classificacao])

    respond_to do |format|
      if @classificacao.save