app/controllers/clubes_controller.rb

SELECT `clubes`.* FROM `clubes`
---
  def index
    @clubes = Clube.all

SELECT `clubes`.* FROM `clubes` WHERE `clubes`.`id` = 1 LIMIT 1
---
  def show
    @clube = Clube.find(params[:id])

INSERT INTO `clubes` (`created_at`, `descricao`, `estadio`, `id`, `nome`, `updated_at`) VALUES ('2012-12-12 13:57:06', 'Melhor time!', 'Arena', 1, 'Gremio', '2012-12-12 13:57:06')
---
  def create
    @clube = Clube.new(params[:clube])

    respond_to do |format|
      if @clube.save