app/controllers/jogos_controller.rb

SELECT `jogos`.* FROM `jogos`
---
  def index
    @jogos = Jogo.all

SELECT `jogos`.* FROM `jogos` WHERE `jogos`.`id` = 1 LIMIT 1
---
  def show
    @jogo = Jogo.find(params[:id])

SELECT `jogos`.* FROM `jogos` WHERE `jogos`.`id` = 1 LIMIT 1
---
  def edit
    @jogo = Jogo.find(params[:id])

INSERT INTO `jogos` (`created_at`, `gols_mandante`, `gols_visitante`, `id_jogo`, `time_mandante`, `time_visitante`, `updated_at`) VALUES ('2012-12-06 22:37:24', '1', '2', NULL, 'Gremio', 'Inter', '2012-12-06 22:37:24')
---
  def create
    @jogo = Jogo.new(params[:jogo])

    respond_to do |format|
      if @jogo.save

SELECT `jogos`.* FROM `jogos` WHERE `jogos`.`id` = 1 LIMIT 1
UPDATE `jogos` SET `id_jogo` = 1, `gols_visitante` = '0', `updated_at` = '2012-12-06 22:38:04' WHERE `jogos`.`id` = 1
---
  def update
    @jogo = Jogo.find(params[:id])

    respond_to do |format|
      if @jogo.update_attributes(params[:jogo])

SELECT `jogos`.* FROM `jogos` WHERE `jogos`.`id` = 2 LIMIT 1
DELETE FROM `jogos` WHERE `jogos`.`id` = 2
---
  def destroy
    @jogo = Jogo.find(params[:id])
    @jogo.destroy