app/controllers/palpites_controller.rb

SELECT `palpites`.* FROM `palpites`
---
  def index
    @palpites = Palpite.all