app/controllers/usuarios_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`created_at`, `email`, `id_usuario`, `nome_completo`, `nome_usuario`, `password`, `updated_at`) VALUES ('2012-11-29 22:26:42', 'felipehvargas@gmail.com', 1, 'Felipe Vargas', 'felipe', 'vargas', '2012-11-29 22:26:42')

  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 3 LIMIT 1
DELETE FROM `usuarios` WHERE `usuarios`.`id` = 3